class PlacrLoc {
  double Lat;
  double Long;
  PlacrLoc(this.Lat, this.Long);
}

class Place {
  bool rec;
  String title;
  String fulltitle;
  String addredd;
  List<String> imageUrl;
  double height;
  String detail;
  double Lat;
  double Long;
  Place(this.rec, this.title, this.fulltitle, this.addredd, this.imageUrl,
      this.height, this.detail, this.Lat, this.Long);

  static List<Place> generateRec() {
    var alllist = generatePlaces() + generateFood();
    List<Place> recs = [];

    for (var name in alllist) {
      if (name.rec) {
        recs.add(name);
      }
    }

    return recs;
  }

  static List<Place> generateFood() {
    return [
      (Place(
          true,
          "เฮือนลับแล",
          "ร้านอาหารเฮือนลับแล",
          " ต.แม่พูล อ.ลับแล",
          [
            'assets/images/hu.jpg',
            'assets/images/hu1.jpg',
            'assets/images/hu2.jpg',
            'assets/images/hu3.jpg'
          ],
          220,
          '    เฮือนลับแล ร้านอาหารและร้านกาแฟกลางสวนผลไม้  พิกัดอยู่ ในอำเภอลับแล จังหวัดอุตรดิตถ์  ใกล้น้ำตกแม่พูล บรรยากาศร้านตกแต่งสไตล์ล้านนาท่ามกลางต้นไม้น้อยใหญ่แสนร่มรื่น ที่นั่งมีทั้งโซนที่นั่งแบบ indoor และ outdoor  รวมถึงที่นั่งริมลำธารที่ไหลจากน้ำตกแม่พูล บริเวณลำธารมีเก้าอี้และแคร่ไม้ไผ่ตั้งอยู่กลางน้ำ สามารถนั่งเล่นหย่อนขาจิบเครื่องดื่ม แช่ลำธารให้เย็นสบาย',
          17.723076215546403,
          99.9817750534851)),
      (Place(
          true,
          "ไร่องุ่นคานาอัน",
          "ไร่องุ่นคานาอัน",
          " ต.น้ำพี้ อ.ทองแสนขัน",
          [
            'assets/images/ka.jpg',
            'assets/images/ka1.jpg',
            'assets/images/ka2.jpg',
            'assets/images/ka3.jpg'
          ],
          200,
          '    ไร่องุ่นคานาอัน ตั้งอยู่ที่ ตำบลน้ำพี้ อำเภอทองแสนขัน จังหวัดอุตรดิตถ์ ไม่ไกลจากบ่อเหล็กน้ำพี้  เป็นไร่องุ่นที่บรรยากาศดีบรรยากาศสุดแสนจะโรแมนติกมีมุมให้ถ่ายภาพมากมาย  ไฮไลท์ คือ สถาปัตยกรรมที่โดดเด่น นั่นคือ อาคารคานาอัน  อาคารสไตล์ทัศคานีของอิตาลี สีสันสดใส สวยงามและโดดเด่น ภายในอาคารจะมีมุมน่ารักให้ถ่ายรูปหลายมุม มีบันไดวนขึ้นไปดาดฟ้าเพื่อที่จะขึ้นไปชมบรรยากาศและทัศนียภาพโดยรอบพื้นที่ได้  ภายในอาคารมีร้านอาหารที่ให้บริการอาหาร เครื่องดื่มเป็นอาหารสไตล์อิตาลี เช่น สเต็ก สปาเก็ตตี้ และอื่นๆ อีกมากมาย เมนูเด็ดที่พลาดไม่ได้ คือ เมี่ยงใบองุ่น ที่นำใบองุ่นมาใช้ทานกับเครื่องเคียงของเมี่ยง ซึ่งทำให้ได้รู้ว่าใบองุ่นทานได้และอร่อยมากเมื่อมาทานเป็นเมี่ยง ส่วนเครื่องดื่มก็มีทั้ง ทั้งชา โกโก้ กาแฟ อิตาเลี่ยนโซดา น้ำผลไม้ รวมทั้งเบเกอรี่ของหวานให้ทานอีกด้วย',
          17.56394920145772,
          100.26110927409799)),
      (Place(
          false,
          "ม่อนลับแล อุตรดิตถ์",
          "ม่อนลับแล อุตรดิตถ์",
          " ต.ศรีพนมมาศ อ.ลับแล",
          [
            'assets/images/mo.jpg',
            'assets/images/mo1.jpg',
            'assets/images/mo2.jpg',
            'assets/images/mo3.jpg',
          ],
          210,
          '    ร้านอาหารในอำเภอลับแล จังหวัดอุตรดิตถ์ ตกแต่งสไตล์ชาวล้านนาตามแบบฉบับของเมืองลับแล ท่ามกลางสวนร่มรื่น ภายในร้านตกแต่งเรียบหรู สะดวกสบาย มีมุมให้นั่งเล่นพักผ่อนหลายมุม ให้ความรู้สึกเหมือนกำลังอยู่ในคุ้มของเจ้านางทางเหนือ  ภายในร้านมีทั้ง zone ร้านกาแฟและร้านอาหาร รวมทั้งเป็นร้านจำหน่ายของฝากและสินค้าหัตถกรรมพื้นเมือง ผลไม้ตามฤดูกาล พื้นที่ของร้านแบ่งเป็น 3 โซน  คือ บ้านของฝากลับแล ซึ่งตั้งอยู่ด้านหน้า ร้านกาแฟลาลีกาซึ่งอยู่ริมถนน และร้านอาหารซึ่งตั้งอยู่ด้านในสุด',
          17.663521346107814,
          100.03396439966828)),
      (Place(
          false,
          "เจ้นีย์ของทอด",
          "เจ้นีย์ของทอดลับแล",
          " ต.ศรีพนมมาศ อ.ลับแล",
          [
            'assets/images/to.jpg',
            'assets/images/to1.jpg',
          ],
          210,
          '    เจ๊นีย์ของทอดลับแล  เปิดขายมายาวนานกว่า 30 ปี ร้านตั้งอยู่บนถนน  ถนนราษฎร์อุทิศ  ซึ่งถนนสายนี้เป็นที่ตั้งของร้านอาหารพื้นเมืองหลายร้าน ตลอดทั้งเส้นทางจะเห็นแต่ร้านขายข้าวพันผัก ก๋วยเตี๋ยว ร้านกาแฟ จุดเด่นของร้าน คือ นำทุกอย่างมาทอดทานกับน้ำจิ้มรสเด็ด  เมนูของทอดขึ้นชื่อ คือ หน่อไม้ไส้หมูสับชุบแป้งทอด ทางร้านนำหน่อไม้สดมาต้มแล้วผ่าออกเป็นสี่ส่วนยัดไส้ด้วยหมูสับชุบแป้งกรุบกรอบแล้วนำไปทอด ทานกับน้ำจิ้มนับเป็นเมนูที่แปลกใหม่ไม่เหมือนใคร ',
          17.653781237681343,
          100.04041012321089)),
      (Place(
          false,
          "ข้าวพันผัก Indy",
          "ข้าวพันผัก Indy",
          " ต.น้ำพี้ อ.ทองแสนขัน",
          [
            'assets/images/ko.jpg',
            'assets/images/ko1.jpg',
          ],
          210,
          '    มาเมืองลับแลต้องลองอาหารท้องถิ่น หนึ่งในอาหารเด่นขึ้นชื่อ คือ ข้าวพันผัก ที่ลับแลมีร้านข้าวพันผักให้เห็นอยู่ทั่วทั้งเมืองอยู่ที่ว่าจะลองทานร้านใด  แต่ถ้าพูดถึงร้านดัง รสชาติเด็ด เมนูแปลก ต้องไปที่ ข้าวพันผัก Indy  หรือชื่อเดิมคือร้านข้าวพักผักป้าตอ  นอกจากตัวร้านที่ตกแต่งน่ารักแบบอินดี้สมชื่อแล้วยังโดดเด่นเรื่องเมนูข้าวพันผักต่างๆ ที่หลายคนอาจคิดว่าเป็นเมนูโบราณ แต่ทางร้านนำมาปรับเปลี่ยนให้ทันสมัย เป็นข้าวพันผักเครื่องแน่นแบบต่างๆที่มีให้เลือกเพียบ',
          17.657278643098234,
          100.03948785491077)),
      (Place(
          false,
          "ตลาดสดศรีนพมาศ",
          "ตลาดสดเทศบาลศรีนพมาศ",
          " ต.ศรีพนมมาศ อ.ลับแล",
          [
            'assets/images/ta.jpg',
            'assets/images/ta1.jpg',
          ],
          210,
          '    ตลาดสดเทศบาลศรีนพมาศ ด้านหน้าตลาดมีความเก๋าและความเก๋ ออกแนวย้อยยุคโบราณสักหน่อย ด้านหน้าเป็นที่ตั้งของอนุสาวรีย์พระศรีพนมมาศคนสำคัญแห่งเมืองลับแลนอกจากเป็นตลาดประจำเภอที่ขายของสด ข้าวของเครื่องใช้ต่างๆแล้ว ตลาดแห่งนี้มีสิ่งที่สะดุดตาที่ใครผ่านไปมาต้องหันมามองและแวะถ่ายภาพ คือ ภาพเพนท์กำแพงที่วาดบนตัวตึกหน้าตลาดเป็นภาพวาดกำแพงที่มีความชิคสีออกแนวพาสเทล ที่เล่าเรื่องราวของวิถีชีวิตคนผู้คนในอดีตอย่างเช่น ร้านโชว์ห่วย ร้านขายกาแฟโบราณ นอกจากภาพวาดบนผนังตึกแล้ว ยังมีภาพวาดที่แสดงถึงวัฒนธรรมการแต่งกายของผู้คนในเมืองลับแล ริมกำแพงยาวอีกด้วย',
          17.65300890842505,
          100.0396076655737)),
    ];
  }

  static List<Place> generatePlaces() {
    return [
      (Place(
          true,
          "เมืองลับแล",
          "ซุ้มประตูเมืองลับแล",
          " ต.ศรีพนมมาศ อ.ลับแล",
          [
            'assets/images/lab.jpg',
            'assets/images/lab2.jpg',
            'assets/images/lab3.jpg',
            'assets/images/lab4.jpg'
          ],
          210,
          '    เมืองลับแลนี้ ได้ชื่อลับแลเพราะเป็นอำเภอเล็กๆ ในจังหวัดอุตรดิตถ์ การที่จะเดินทางไปมาไม่สะดวก มีเส้นทางที่คดเคี้ยว ทำให้คนที่ไม่ชำนาญทางพลัดหลงได้ง่าย จนได้ชื่อว่าเมืองลับแล ซึ่งแปลว่า มองไม่เห็น แต่ในอีกการเล่าขานหนึ่งก็คือ ในสมัยก่อนนั้น มีภูมิประเทศเป็นป่าเขาสลับซับซ้อน มีบรรยากาศเยือกเย็นแม้ยามพลบค่ำตะวันจะยังไม่ตกดินก็จะมืดแล้ว เพราะมีดอยม่อนฤๅษีเป็นฉากกั้นแสงอาทิตย์ ป่านี้จึงได้ชื่อว่า "ป่าลับแลง" แลง ที่แปลว่า เวลาเย็น ต่อมาเรียกเพี้ยนไปเป็น "ลับแล" ซึ่งก็กลายมาเป็นชื่ออำเภอลับแลในสมัยปัจจุบัน',
          17.651638956531862,
          100.04445792332073)),
      (Place(
          true,
          "ภูสอยดาว",
          "อุทยานแห่งชาติภูสอยดาว",
          "  ต.ห้วยมุ่น อ.น้ำปาด",
          [
            'assets/images/pu.jpg',
            'assets/images/pu2.jpg',
            'assets/images/pu3.jpg',
            'assets/images/pu4.jpg'
          ],
          190,
          '     มีลักษณะภูมิประเทศเป็นภูเขาสลับซับซ้อน เป็นแหล่งต้นน้ำของลำน้ำปาด สภาพอากาศเย็นสบายตลอดปี มีอุณหภูมิเฉลี่ยประมาณ 27 องศาเซลเซียส มีเทือกเขา กั้นพรมแดนระหว่างไทย-ลาว ยอดภูสอยดาวมีความสูงจากระดับน้ำทะเลปานกลางประมาณ 2,102 เมตร (อยู่ในเขตประเทศลาว) สูงเป็นอันดับ 5 ของประเทศ สภาพป่ามีความอุดมสมบูรณ์ประกอบด้วยป่าสนเขา ป่าดิบเขา ป่าดิบชื้น ป่าดิบแล้ง ป่าเบญจพรรณ และป่าเต็งรัง (ภูสอยดาวในเขตประเทศไทยหมายถึงลานสนซึ่งเป็นส่วนหนึ่งของภูสอยดาว อยู่ที่ระดับความสูงจากระดับน้ำทะเลปานกลางประมาณ 1,633 เมตร)',
          17.69616960817237,
          100.94719061789914)),
      (Place(
          true,
          "เขื่อนสิริกิติ์",
          "เขื่อนสิริกิติ์ (เขื่อนท่าปลา)",
          " ต.ผาเลือด อ.ท่าปลา",
          [
            'assets/images/si.jpg',
            'assets/images/si1.jpg',
            'assets/images/si2.jpg',
            'assets/images/si3.jpg'
          ],
          210,
          '    เขื่อนสิริกิติ์ หรือที่เรียกกันในชื่อท้องถิ่นว่า เขื่อนท่าปลา จัดเป็นเขื่อนดินที่มีขนาดใหญ่ที่สุดในประเทศไทย อยู่ในอำเภอท่าปลา จังหวัดอุตรดิตถ์ กั้นแม่น้ำน่าน ที่ไหลลงมาจากอำเภอนาหมื่น จังหวัดน่าน เดิมอยู่ในความดูแลของกรมชลประทาน กระทรวงเกษตรและสหกรณ์ ภายหลังได้ติดตั้งโรงไฟฟ้าพลังงาน และมอบให้การไฟฟ้าฝ่ายผลิตแห่งประเทศไทยเป็นผู้รับผิดชอบดูแลต่อไป ทั้งนี้พื้นที่เหนือเขื่อนเป็นแอ่งเก็บน้ำขนาดใหญ่ และเป็นสถานที่ท่องเที่ยวที่สำคัญของจังหวัดอุตรดิตถ์ด้วย',
          17.764425664010798,
          100.56381217835141)),
      (Place(
          false,
          "วัดพระแท่น",
          "วัดพระแท่นศิลาอาสน",
          " ต.ทุ่งยั้ง อ.ลับแล",
          [
            'assets/images/tan.jpg',
            'assets/images/tan2.jpg',
            'assets/images/tan3.jpg',
            'assets/images/tan4.jpg'
          ],
          200,
          '   เดิมชื่อ วัดมหาธาตุ ตั้งอยู่ที่บนเนินเขาเต่า บ้านพระแท่น ตำบลทุ่งยั้ง ติดกับวัดพระยืนพุทธบาทยุคล ซึ่งตั้งอยู่ทางด้านทิศตะวันออกบนเนินเขาลูกเดียวกันแต่คนละยอด เป็นวัดโบราณไม่ปรากฏหลักฐานว่าผู้ใดสร้าง และสร้างแต่เมื่อใดทางราชการได้นำพระแท่นศิลาอาสน์ไปประดิษฐานไว้ในตราประจำจังหวัดอุตรดิตถ์แสดงถึงความศรัทธาเลื่อมใสและความสำคัญขององค์พระแท่นศิลาอาสน์ได้เป็นอย่างดี ปัจจุบันวัดพระแท่นศิลาอาสน์ ได้รับการยกฐานะขึ้นเป็นพระอารามหลวงชั้นตรี สังกัดธรรมยุตินิกาย เมื่อปี พ.ศ. 2549 พระแท่นศิลาอาสน์เป็นพุทธเจดีย์ เช่นเดียวกับ พระแท่นดงรัง เป็นที่เชื่อกันมาแต่โบราณว่าสมเด็จพระสัมมาสัมพุทธเจ้าทั้งห้าพระองค์ในภัทรกัปนี้ ได้เสด็จและจะได้เสด็จมาประทับนั่งบนพระแท่นแห่งนี้ เพื่อเจริญภาวนา และได้ประทับยับยั้งในเวลาที่ตรัสรู้แล้วเพื่อโปรดสัตว์ซึ่งแสดงว่าพระแท่นศิลาอาสน์นี้มีประวัติความเป็นมาอย่างต่อเนื่องในพระพุทธศาสนามายาวนาน',
          14.035656157038822,
          99.7878130240933)),
      (Place(
          false,
          "พระธาตุทุ่งยั้ง",
          "วัดพระบรมธาตุทุ่งยั้ง",
          " ต.ทุ่งยัง อ.ลับแล",
          [
            'assets/images/tu.jpg',
            'assets/images/tu1.jpg',
            'assets/images/tu2.jpg',
            'assets/images/tu3.jpg'
          ],
          210,
          '    วัดพระบรมธาตุทุ่งยั้ง เป็นวัดสำคัญประจำเมืองทุ่งยั้ง ซึ่งเป็นส่วนหนึ่งของอำเภอลับแลค่ะ สันนิษฐานว่าสร้างในสมัยกรุงสุโขทัยตอนปลาย ช่วงสมัย สมเด็จพระมหาธรรมราชาที่ 1 หรือ พระยาลิไทย  ภายในวัดมีโบราณสถานและโบราณวัตถุที่น่าสนใจ คือ วิหารหลวงเก่าแก่ สมัยกรุงศรีอยุธยาก่อด้วยศิลาแลงและอิฐ หลังคาลดหลั่น 3 ชั้น หน้าบันแกะสลักลงรักปิดทองสวยงามมาก ประดิษฐาน หลวงพ่อหลักเมือง หรือ หลวงพ่อโต ชาวบ้านนิยมเรียกว่า หลวงพ่อประธานเฒ่า นับเป็นพระพุทธรูปศักดิ์สิทธิ์ เป็นที่เคารพสักการะของคนในพื้นที่ค่ะ',
          17.60028842248499,
          100.05581050491044)),
      (Place(
          false,
          "ต้นสักใหญ่",
          "อุทยานแห่งชาติต้นสักใหญ่",
          " ต.น้ำไคร้ อ.น้ำปาด",
          [
            'assets/images/sak.jpg',
            'assets/images/sak2.jpg',
            'assets/images/sak3.jpg',
            'assets/images/sak4.jpg'
          ],
          200,
          '    อุทยานแห่งชาติต้นสักใหญ่ เป็นอุทยานแห่งผืนป่าเบญจพรรณที่มีเนื้อที่ 22,000 ไร่  ไฮไลท์ คือ ต้นสักใหญ่ที่สุดในโลก มีอายุประมาณ 1,000 ปี ซึ่งค้นพบเมื่อประมาณปี พ.ศ. 2470 สักใหญ่ต้นนี้ ลำต้นโต ขนาด 8 คนโอบ วัดโดยรอบได้ 948เซนติเมตร และความสูง 38.5 เมตร เนื่องจากส่วนยอดถูกลมพายุพัดหักแต่ลำต้นทั่วไปยังคงอยู่ในสภาพที่ดี',
          17.657381973397705,
          100.56904631785054)),
      (Place(
          true,
          "อุทยานลำน้ำน่าน",
          "อุทยานแห่งชาติลำน้ำน่าน",
          " ต.ผาเลือด อ.ท่าปลา",
          [
            'assets/images/lum.jpg',
            'assets/images/lum1.jpg',
            'assets/images/lum2.jpg',
            'assets/images/lum3.jpg'
          ],
          210,
          '    อุทยานแห่งชาติลำน้ำน่าน เป็นอุทยานที่ตั้งอยู่ในเขตพื้นที่ 2จังหวัด คือ ในอำเภอน้ำปาด อำเภอท่าปลา อำเภอบ้านโคก จ.อุตรดิตถ์ และ อำเภอเมือง จังหวัดแพร่ ภูมิประเทศโดยรวมเป็นเทือกเขาสูงสลับซับซ้อนกันพื้นที่อุทยานมีความอุดมสมบูรณ์สูง มีป่าไม้มากมาย ได้แก่ ป่าเต็งรัง ป่าเบญจพรรณ ป่าดิบเขา และ ป่าดิบแล้ง โดยบริเวณอุทยานแห่งชาติลำน้ำน่านนี้เป็นต้นกำเนิดของแม่น้ำยมในจังหวัดแพร่ และเป็นแม่น้ำสาขาในแม่น้ำน่านที่ไหลลงสู่จ.อุตรดิตถ์ อุทยานแห่งชาติลำน้ำน่านมีพื้นที่โดยรวมทั้งหมด 999.15 ตารางกิโลเมตร หรือ 624,468 ไร่เศษ โดยสรุปแล้วอุทยานแห่งนี้ตั้งอยู่บนเหนือสันเขื่อนสิริกิติ์ในทางทิศเหนือ อุทยานแห่งลำน้ำน่านได้รับประกาศเป็นอุทยานแห่งชาติ เมื่อวันที่ 30 กันยายน พ.ศ. 2541',
          17.767059600658342,
          100.48670444575257)),
      (Place(
          false,
          "บ่อเหล็กน้ำพี้",
          "บ่อเหล็กน้ำพี้",
          " ต.น้ำพี้ อ.น้ำปาด",
          [
            'assets/images/num.jpg',
            'assets/images/num1.jpg',
            'assets/images/num2.jpg',
            'assets/images/num3.jpg'
          ],
          210,
          '    บ่อเหล็กน้ำพี้  ตั้งอยู่ที่บ้านน้ำพี้ หมู่ 1 ตำบลน้ำพี้ อำเภอทองแสนขัน จังหวัดอุตรดิตถ์ ห่างจากตัวจังหวัดอุตรดิตถ์ประมาณ 56 กิโลเมตร เป็นแหล่งสินแร่เหล็กตามธรรมชาติโดยเป็นบ่อเหล็กกล้ามีอยู่ด้วยกันหลายบ่อ และปรากฏเตาถลุงเหล็กโบราณนับพัน แห่งในพื้นที่หลายตารางกิโลเมตร แต่บ่อที่สำคัญและสงวนใช้สำหรับพระมหากษัตริย์ มีอยู่ 2 บ่อ คือ บ่อพระแสง และ บ่อพระขรรค์ มีการนำแร่เหล็กจากบ่อเหล็กน้ำพี้ไปถลุงทำอาวุธเพื่อใช้ในการศึกสงครามมาตั้งแต่สมัยโบราณ ดังปรากฏหลักฐานทางประวัติศาสตร์ถึงความสำคัญของเหล็กน้ำพี้ โดยเฉพาะอย่างยิ่งมีความเชื่อมาแต่โบราณว่าเหล็กจากแหล่งแร่เหล็กน้ำพี้มีความแข็งแกร่ง ความศักดิ์สิทธิ์และอาถรรพ์ในตัว  ในปัจจุบันชาวบ้านน้ำพี้มีการขุดแร่เหล็กน้ำพี้มาทำวัตถุมงคล เป็นส่วนผสมในการทำดาบ พระเครื่อง พระบูชาและเครื่องรางของขลังต่างๆ และเครื่องใช้เพื่อใช้ประกอบอาชีพจำหน่อยให้กับนักท่องเที่ยวและคนทั่วไปที่สนใจ',
          17.540684263482717,
          100.30006922494448)),
    ];
  }
}
