class Place {
  String title;
  String fulltitle;
  String addredd;
  List<String> imageUrl;
  double height;
  String detail;
  Place(this.title, this.fulltitle, this.addredd, this.imageUrl, this.height,
      this.detail);

  static List<Place> generatePlaces() {
    return [
      (Place(
          "เมืองลับแล",
          "ซุ้มประตูเมืองลับแล",
          " ต.ศรีพนมมาศ อ.ลับแล",
          [
            'assets/images/lab.jpg',
            'assets/images/lab2.jpg',
            'assets/images/lab3.jpg',
            'assets/images/lab4.jpg'
          ],
          200,
          '       เมืองลับแลนี้ ได้ชื่อลับแลเพราะเป็นอำเภอเล็กๆ ในจังหวัดอุตรดิตถ์ การที่จะเดินทางไปมาไม่สะดวก มีเส้นทางที่คดเคี้ยว ทำให้คนที่ไม่ชำนาญทางพลัดหลงได้ง่าย จนได้ชื่อว่าเมืองลับแล ซึ่งแปลว่า มองไม่เห็น แต่ในอีกการเล่าขานหนึ่งก็คือ ในสมัยก่อนนั้น มีภูมิประเทศเป็นป่าเขาสลับซับซ้อน มีบรรยากาศเยือกเย็นแม้ยามพลบค่ำตะวันจะยังไม่ตกดินก็จะมืดแล้ว เพราะมีดอยม่อนฤๅษีเป็นฉากกั้นแสงอาทิตย์ ป่านี้จึงได้ชื่อว่า "ป่าลับแลง" แลง ที่แปลว่า เวลาเย็น ต่อมาเรียกเพี้ยนไปเป็น "ลับแล" ซึ่งก็กลายมาเป็นชื่ออำเภอลับแลในสมัยปัจจุบัน')),
      (Place(
          "ภูสอยดาว",
          "อุทยานแห่งชาติภูสอยดาว",
          "  ต.ห้วยมุ่น อ.น้ำปาด",
          [
            'assets/images/pu.jpg',
            'assets/images/pu2.jpg',
            'assets/images/pu3.jpg',
            'assets/images/pu4.jpg'
          ],
          250,
          '        มีลักษณะภูมิประเทศเป็นภูเขาสลับซับซ้อน เป็นแหล่งต้นน้ำของลำน้ำปาด สภาพอากาศเย็นสบายตลอดปี มีอุณหภูมิเฉลี่ยประมาณ 27 องศาเซลเซียส มีเทือกเขา กั้นพรมแดนระหว่างไทย-ลาว ยอดภูสอยดาวมีความสูงจากระดับน้ำทะเลปานกลางประมาณ 2,102 เมตร (อยู่ในเขตประเทศลาว) สูงเป็นอันดับ 5 ของประเทศ สภาพป่ามีความอุดมสมบูรณ์ประกอบด้วยป่าสนเขา ป่าดิบเขา ป่าดิบชื้น ป่าดิบแล้ง ป่าเบญจพรรณ และป่าเต็งรัง (ภูสอยดาวในเขตประเทศไทยหมายถึงลานสนซึ่งเป็นส่วนหนึ่งของภูสอยดาว อยู่ที่ระดับความสูงจากระดับน้ำทะเลปานกลางประมาณ 1,633 เมตร)')),
      (Place(
          "วัดพระแท่น",
          "วัดพระแท่นศิลาอาสน",
          " ต.ทุ่งยั้ง อ.ลับแล",
          [
            'assets/images/tan.jpg',
            'assets/images/tan2.jpg',
            'assets/images/tan3.jpg',
            'assets/images/tan4.jpg'
          ],
          250,
          '      เดิมชื่อ วัดมหาธาตุ ตั้งอยู่ที่บนเนินเขาเต่า บ้านพระแท่น ตำบลทุ่งยั้ง ติดกับวัดพระยืนพุทธบาทยุคล ซึ่งตั้งอยู่ทางด้านทิศตะวันออกบนเนินเขาลูกเดียวกันแต่คนละยอด เป็นวัดโบราณไม่ปรากฏหลักฐานว่าผู้ใดสร้าง และสร้างแต่เมื่อใดทางราชการได้นำพระแท่นศิลาอาสน์ไปประดิษฐานไว้ในตราประจำจังหวัดอุตรดิตถ์แสดงถึงความศรัทธาเลื่อมใสและความสำคัญขององค์พระแท่นศิลาอาสน์ได้เป็นอย่างดี ปัจจุบันวัดพระแท่นศิลาอาสน์ ได้รับการยกฐานะขึ้นเป็นพระอารามหลวงชั้นตรี สังกัดธรรมยุตินิกาย เมื่อปี พ.ศ. 2549 พระแท่นศิลาอาสน์เป็นพุทธเจดีย์ เช่นเดียวกับ พระแท่นดงรัง เป็นที่เชื่อกันมาแต่โบราณว่าสมเด็จพระสัมมาสัมพุทธเจ้าทั้งห้าพระองค์ในภัทรกัปนี้ ได้เสด็จและจะได้เสด็จมาประทับนั่งบนพระแท่นแห่งนี้ เพื่อเจริญภาวนา และได้ประทับยับยั้งในเวลาที่ตรัสรู้แล้วเพื่อโปรดสัตว์ซึ่งแสดงว่าพระแท่นศิลาอาสน์นี้มีประวัติความเป็นมาอย่างต่อเนื่องในพระพุทธศาสนามายาวนาน')),
      (Place(
          "ต้นสักใหญ่",
          "อุทยานแห่งชาติต้นสักใหญ่",
          " ต.น้ำไคร้ อ.น้ำปาด",
          [
            'assets/images/sak.jpg',
            'assets/images/sak2.jpg',
            'assets/images/sak3.jpg',
            'assets/images/sak4.jpg'
          ],
          200,
          '       อุทยานแห่งชาติต้นสักใหญ่ เป็นอุทยานแห่งผืนป่าเบญจพรรณที่มีเนื้อที่ 22,000 ไร่  ไฮไลท์ คือ ต้นสักใหญ่ที่สุดในโลก มีอายุประมาณ 1,000 ปี ซึ่งค้นพบเมื่อประมาณปี พ.ศ. 2470 สักใหญ่ต้นนี้ ลำต้นโต ขนาด 8 คนโอบ วัดโดยรอบได้ 948เซนติเมตร และความสูง 38.5 เมตร เนื่องจากส่วนยอดถูกลมพายุพัดหักแต่ลำต้นทั่วไปยังคงอยู่ในสภาพที่ดี')),
      (Place(
          "เขื่อนสิริกิติ์",
          "เขื่อนสิริกิติ์ (เขื่อนท่าปลา)",
          " ต.ผาเลือด อ.ท่าปลา",
          [
            'assets/images/si.jpg',
            'assets/images/si1.jpg',
            'assets/images/si2.jpg',
            'assets/images/si3.jpg'
          ],
          200,
          '       เขื่อนสิริกิติ์ หรือที่เรียกกันในชื่อท้องถิ่นว่า เขื่อนท่าปลา จัดเป็นเขื่อนดินที่มีขนาดใหญ่ที่สุดในประเทศไทย อยู่ในอำเภอท่าปลา จังหวัดอุตรดิตถ์ กั้นแม่น้ำน่าน ที่ไหลลงมาจากอำเภอนาหมื่น จังหวัดน่าน เดิมอยู่ในความดูแลของกรมชลประทาน กระทรวงเกษตรและสหกรณ์ ภายหลังได้ติดตั้งโรงไฟฟ้าพลังงาน และมอบให้การไฟฟ้าฝ่ายผลิตแห่งประเทศไทยเป็นผู้รับผิดชอบดูแลต่อไป ทั้งนี้พื้นที่เหนือเขื่อนเป็นแอ่งเก็บน้ำขนาดใหญ่ และเป็นสถานที่ท่องเที่ยวที่สำคัญของจังหวัดอุตรดิตถ์ด้วย')),
      (Place(
          "อุทยานลำน้ำน่าน",
          "อุทยานแห่งชาติลำน้ำน่าน",
          " ต.ผาเลือด อ.ท่าปลา",
          [
            'assets/images/lum.jpg',
            'assets/images/lum1.jpg',
            'assets/images/lum2.jpg',
            'assets/images/lum3.jpg'
          ],
          200,
          '       อุทยานแห่งชาติลำน้ำน่าน เป็นอุทยานที่ตั้งอยู่ในเขตพื้นที่ 2จังหวัด คือ ในอำเภอน้ำปาด อำเภอท่าปลา อำเภอบ้านโคก จ.อุตรดิตถ์ และ อำเภอเมือง จังหวัดแพร่ ภูมิประเทศโดยรวมเป็นเทือกเขาสูงสลับซับซ้อนกันพื้นที่อุทยานมีความอุดมสมบูรณ์สูง มีป่าไม้มากมาย ได้แก่ ป่าเต็งรัง ป่าเบญจพรรณ ป่าดิบเขา และ ป่าดิบแล้ง โดยบริเวณอุทยานแห่งชาติลำน้ำน่านนี้เป็นต้นกำเนิดของแม่น้ำยมในจังหวัดแพร่ และเป็นแม่น้ำสาขาในแม่น้ำน่านที่ไหลลงสู่จ.อุตรดิตถ์ อุทยานแห่งชาติลำน้ำน่านมีพื้นที่โดยรวมทั้งหมด 999.15 ตารางกิโลเมตร หรือ 624,468 ไร่เศษ โดยสรุปแล้วอุทยานแห่งนี้ตั้งอยู่บนเหนือสันเขื่อนสิริกิติ์ในทางทิศเหนือ อุทยานแห่งลำน้ำน่านได้รับประกาศเป็นอุทยานแห่งชาติ เมื่อวันที่ 30 กันยายน พ.ศ. 2541')),
    ];
  }
}
